Repository: tachibana-shin/assistant.koplugin
Catalog: l10n/*/koreader.po
Languages: th

source: API Error: %1 Try another provider in the settings dialog.
th: ข้อผิดพลาด API: %1 ลองใช้ผู้ให้บริการรายอื่นในการตั้งค่า

source: Unknown error
th: ไม่ทราบข้อผิดพลาด

source: Settings
th: ตั้งค่า

source: X‑Ray
th: เอกซ์เรย์

source: AI X-Ray
th: เอกซ์เรย์ AI

source: Purge Settings
th: ล้างการตั้งค่า

source: Are you sure to purge the assistant plugin settings? This resets the assistant plugin to the status the first time you installed it. configuration.lua is safe, only the settings in the dialog are purged.
th: ยืนยันล้างการตั้งค่าปลั๊กอินผู้ช่วย? จะรีเซ็ตปลั๊กอินเหมือนตอนติดตั้งครั้งแรก ไฟล์ configuration.lua ไม่ได้รับผลกระทบ ลบเฉพาะค่าตั้งค่าในหน้าต่าง

source: Purge
th: ล้าง

source: (Empty message)
th: (ข้อความว่าง)

source: (No response)
th: (ไม่มีคำตอบ)

source: Highlighted text:
th: ข้อความที่ไฮไลต์:

source: Cancel
th: ยกเลิก

source: Ask
th: ถาม

source: Enter a question before proceeding.
th: กรุณาใส่คำถามก่อน

source: Book Analysis
th: วิเคราะห์หนังสือ

source: Add this button to the Highlight Menu?
th: เพิ่มปุ่มนี้ในเมนูไฮไลต์หรือไม่?

source: Add
th: เพิ่ม

source: Ask a question about the highlighted text
th: ถามเกี่ยวกับข้อความที่ไฮไลต์

source: Ask a question about this book: %s by %s
th: ถามเกี่ยวกับหนังสือเล่มนี้: %s โดย %s

source: Type your question here...
th: พิมพ์คำถามที่นี่...

source: Ask anything about this book...
th: ถามอะไรก็ได้เกี่ยวกับหนังสือ...

source: AI Assistant
th: ผู้ช่วย AI

source: Error: No response received
th: ข้อผิดพลาด: ไม่ได้รับคำตอบ

source: AI Dictionary
th: พจนานุกรม AI

source: Enter a word to look up...
th: ใส่คำที่ต้องการค้นหา...

source: Look Up
th: ค้นหา

source: Dictionary
th: พจนานุกรม

source: This prompt acts as a dictionary for the highlighted text, to a word or phrase.
th: ใช้เป็นพจนานุกรมสำหรับข้อความที่ไฮไลต์

source: Vocabulary
th: คำศัพท์

source: This prompt analyzes the vocabulary of the highlighted text, identifying complex words and providing definitions, synonyms, and usage examples.
th: วิเคราะห์คำศัพท์ในข้อความที่ไฮไลต์

source: Grammar
th: ไวยากรณ์

source: This prompt analyzes the grammar of the highlighted text, providing a detailed explanation of its structure and any grammatical errors.
th: วิเคราะห์ไวยากรณ์ของข้อความที่ไฮไลต์

source: Translate
th: แปล

source: This prompt translates the highlighted text to another language.
th: แปลข้อความที่ไฮไลต์เป็นภาษาอื่น

source: Summarize
th: สรุป

source: This prompt summarizes the highlighted text, capturing its main points and essential details.
th: สรุปข้อความที่ไฮไลต์ให้กระชับ

source: Simplify
th: ทำให้ง่าย

source: This prompt simplifies the highlighted text to make it easier to understand.
th: ทำให้ข้อความที่ไฮไลต์เข้าใจง่ายขึ้น

source: Key Points
th: ประเด็นสำคัญ

source: This prompt extracts and lists the key points from the highlighted text, ensuring clarity and organization.
th: สกัดประเด็นสำคัญจากข้อความที่ไฮไลต์

source: ELI5
th: อธิบายแบบเด็ก 5 ขวบ

source: This prompt explains the highlighted text as if to a five-year-old, simplifying complex concepts into easily understandable terms.
th: อธิบายข้อความให้เด็กเข้าใจได้ง่าย

source: Explain
th: อธิบาย

source: This prompt explains the highlighted text in detail, ensuring clarity and understanding.
th: อธิบายข้อความที่ไฮไลต์อย่างละเอียด

source: Historical Context
th: บริบทประวัติศาสตร์

source: This prompt provides a detailed historical context for the highlighted text, explaining its significance and background.
th: อธิบายบริบททางประวัติศาสตร์ของข้อความที่ไฮไลต์

source: Wikipedia
th: วิกิพีเดีย

source: This prompt generates a comprehensive Wikipedia-style article based on the highlighted text, ensuring factual accuracy and neutrality.
th: สร้างบทความสไตล์วิกิพีเดียจากข้อความที่ไฮไลต์

source: Conjugation
th: การผันรูป

source: Synonyms
th: คำพ้องความหมาย

source: Meaning
th: ความหมาย

source: Translation
th: การแปล

source: Explanation
th: คำอธิบาย

source: Example
th: ตัวอย่าง

source: Word Origin
th: ที่มาของคำ

source: Provider settings not found for: %1. Please check your configuration.lua file.
th: ไม่พบการตั้งค่าผู้ให้บริการสำหรับ: %1 โปรดตรวจสอบไฟล์ configuration.lua ของคุณ

source: The handler for %1 was not found. Please ensure the handler exists in api_handlers directory.
th: ไม่พบตัวจัดการสำหรับ %1 โปรดตรวจสอบว่าตัวจัดการมีอยู่ในไดเรกทอรี api_handlers

source: Close
th: ปิด

source: Plugin is not configured.
th: ปลั๊กอินยังไม่ได้ตั้งค่า

source: Querying AI ...
th: กำลังสอบถาม AI...

source: AI is responding
th: AI กำลังตอบ

source: ⏹ Stop
th: ⏹ หยุด

source: Response interrupted.
th: การตอบกลับถูกหยุด

source: No response received.
th: ไม่ได้รับคำตอบ

source: Failed to start subprocess for request
th: ไม่สามารถเริ่มกระบวนการย่อยสำหรับคำขอ

source: Deeply Thought
th: คิดลึก

source: Recap
th: สรุป

source: AI Response Language Setting
th: การตั้งค่าภาษาในการตอบของ AI

source: AI Response Language
th: ภาษาคำตอบ AI

source: Leave blank to use: %1
th: เว้นว่างเพื่อใช้: %1

source: Dictionary Language
th: ภาษาพจนานุกรม

source: Clear
th: ล้าง

source: Save
th: บันทึก

source: AI Language: %1
th: ภาษาของ AI: %1

source: RTL written Language
th: ภาษาเขียนจากขวาไปซ้าย

source: Leave these fields blank to use the UI language: %1
th: เว้นว่างเพื่อใช้ภาษาอินเทอร์เฟซ: %1

source: Response Font Size
th: ขนาดตัวอักษรคำตอบ

source: Font Size: %1
th: ขนาดฟอนต์: %1

source: AI Assistant Settings
th: การตั้งค่า AI ผู้ช่วย

source: Always enable stream response
th: เปิดคำตอบแบบสตรีมเสมอ

source: Use AI Assistant for 'Translate'
th: ใช้ผู้ช่วย AI สำหรับ "แปล"

source: Show Dictionary(AI) in Dictionary Popup
th: แสดงพจนานุกรม AI ในป็อปอัพ

source: Show Wikipedia(AI) in Dictionary Popup
th: แสดงวิกิพีเดีย AI ในป็อปอัพ

source: Copy entered question to the clipboard
th: คัดลอกคำถามไปคลิปบอร์ด

source: Enable AI Recap
th: เปิดสรุป AI

source: AI Recap will be enabled the next time a book is opened.
th: สรุป AI จะทำงานเมื่อเปิดหนังสือครั้งถัดไป

source: AI Assistant Features:
th: คุณสมบัติของผู้ช่วย AI:

source: AI Model provider:
th: ผู้ให้บริการโมเดล AI:

source: Checking for updates...
th: กำลังตรวจสอบอัปเดต...

source: A new version of the %s plugin (%s) is available. Please update!
th: มีเวอร์ชันใหม่ของปลั๊กอิน %s (%s) กรุณาอัปเดต!

source: Ask Another Question
th: ถามคำถามต่อไป

source: Copy
th: คัดลอก

source: Text copied to the clipboard
th: คัดลอกข้อความไปยังคลิปบอร์ดแล้ว

source: Add Note
th: เพิ่มโน้ต

source: Highlight functionality not available
th: ไม่สามารถไฮไลต์ได้

source: No text to add as note
th: ไม่มีข้อความให้เพิ่มเป็นโน้ต

source: No text left to add as note
th: ไม่เหลือข้อความให้เพิ่มเป็นโน้ต

source: Note added successfully
th: เพิ่มโน้ตสำเร็จ

source: Type your question here
th: พิมพ์คำถามที่นี่

source: Word copied to clipboard.
th: คัดลอกคำแล้ว

source: Selection copied to clipboard.
th: คัดลอกข้อความที่เลือกแล้ว

source: Ask the AI a question
th: ถาม AI

source: AI Recaps
th: สรุป AI

source: No valid model provider is found in the configuration.lua
th: ไม่พบโมเดลโปรไวเดอร์ที่ใช้งานได้ใน configuration.lua

source: Configuration Error. Please set up configuration.lua.
th: เกิดข้อผิดพลาดการตั้งค่า กรุณาตั้งค่า configuration.lua

source: Useful Tips: Long Press: - On a Prompt Button: Add to the highlight menu. - On a highlight menu button to remove it. Very-Long Press (over 3 seconds): On a single word in the book to show the highlight menu (instead of the dictionary). Multi-Swipe (e.g., ⮠, ⮡, ↺): On the result dialog to close (as the Close button is far to reach).
th: เคล็ดลับ: กดค้าง: - ที่ปุ่มคำสั่ง: เพิ่มในเมนูไฮไลต์ - ที่ปุ่มในเมนูไฮไลต์: ลบออก กดค้างนานมาก (เกิน 3 วินาที): ที่คำเดี่ยว: แสดงเมนูไฮไลต์ (แทนพจนานุกรม) ปัดหลายทิศทาง (เช่น ⮠, ⮡, ↺): ปิดหน้าต่างผลลัพธ์ (แทนการกดปุ่มปิด)

source: configuration.lua: model providers are invalid.
th: configuration.lua: โมเดลโปรไวเดอร์ไม่ถูกต้อง

source: Remove [%s] from Highlight Menu?
th: ลบ [%s] ออกจากเมนูไฮไลต์หรือไม่?

source: Remove
th: ลบ

source: Configuration not found. Please set up configuration.lua first.
th: ไม่พบการตั้งค่า กรุณาตั้งค่า configuration.lua ก่อน

source: Added [%1 (AI)] to Highlight Menu.
th: เพิ่ม [%1 (AI)] ลงเมนูไฮไลต์แล้ว

source: Removed [%s (AI)] from Highlight Menu.
th: ลบ [%s (AI)] ออกจากเมนูไฮไลต์แล้ว

source: Do you want an AI Recap? For %s by %s. Last read %.0f hour(s) ago.
th: ต้องการสรุป AI? สำหรับ %s โดย %s อ่านครั้งล่าสุด %.0f ชม. ก่อน

source: Yes
th: ใช่

source: No
th: ไม่

source: 💡 Enhance your KOReader experience with AI
th: 💡 ยกระดับ KOReader ด้วย AI
